app/Models/ModelRuangan.php

SELECT *
FROM `ruangan`
---
    public function getRuangan(){
        return $this->findAll();

SELECT `foto`
FROM `foto_ruangan`
WHERE `id_ruangan` = '4'
 LIMIT 1
---
    public function getFotoByIdRuangan($idRuangan){
        $db = \Config\Database::connect();
        $builder = $db->table('foto_ruangan');
        $builder->select('foto');
        $builder->where('id_ruangan', $idRuangan);
        $builder->limit(1);
        $query = $builder->get();